The original link is here:
https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/

In [1]:
import pandas as pd
import dateutil

In [2]:
data=pd.read_csv("/Users/shengyuchen/Dropbox/Engagement - Business/My Hub/AI:ML:DL Playground/Local Python/Python Data Manipulations/phone_data.csv")

In [3]:
data.head()

   index            date  duration  item    month   network network_type
0      0  15/10/14 06:58    34.429  data  2014-11      data         data
1      1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 830 entries, 0 to 829
Data columns (total 7 columns):
index           830 non-null int64
date            830 non-null object
duration        830 non-null float64
item            830 non-null object
month           830 non-null object
network         830 non-null object
network_type    830 non-null object
dtypes: float64(1), int64(1), object(5)
memory usage: 45.5+ KB

In [6]:
data['date']=data["date"].apply(dateutil.parser.parse,dayfirst=True) 

# A different way of handliing importing the date column

In [8]:
data.head()

   index                date  duration  item    month   network network_type
0      0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1      1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2      2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3      3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4      4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile

In [10]:
#How many rows there are in the dataset
data.shape[0]
data.item.count() # LIterally count a column

830

In [13]:
# What was the longest phone call/data entry
# One way of achieving this 
data.duration.sort_values(ascending=False)[:10]

816    10528.0
742     2328.0
252     2120.0
59      1940.0
648     1863.0
398     1859.0
31      1714.0
809     1325.0
548     1247.0
105     1234.0
Name: duration, dtype: float64

In [14]:
# Alternative way of finding out that answer
data.duration.max()

10528.0

In [16]:
# How many seconds of phone calls are reocrded in total
data.network_type.value_counts()

mobile       601
data         150
landline      42
voicemail     27
world          7
special        3
Name: network_type, dtype: int64

In [17]:
data.item.value_counts()

call    388
sms     292
data    150
Name: item, dtype: int64

In [19]:
data.duration[data.item=="call"].sum()

92321.0

In [20]:
# How many entries are there for each month
data.month.value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [21]:
# Number of non-null unique network entries 
data.network.nunique() # Direct command to extract this information

9

# Summarizing Groups in dataframe

Groupby essentially splits the data into different groups depending on a variable of the choice. 

The groupby() function returns a groupby object, but essentially describes how the rows of the original data set has been split. The Groupby object groups variable is a dictionary whose keys are computed unique groups and corresponding values being the axis labels belonging to each group.

In [25]:
data.groupby(["month"]).groups.keys()
# No difference in writing it like this: data.groupby("month").groups.keys()

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [27]:
len(data.groupby("month").groups["2014-11"])

230

In [28]:
# Functions like max(), min(), first(), last() can be applied to groupby object
data.groupby("month").first()

         index                date  duration  item   network network_type
month
2014-11      0 2014-10-15 06:58:00    34.429  data      data         data
2014-12    228 2014-11-13 06:58:00    34.429  data      data         data
2015-01    381 2014-12-13 06:58:00    34.429  data      data         data
2015-02    577 2015-01-13 06:58:00    34.429  data      data         data
2015-03    729 2015-02-12 20:15:00    69.000  call  landline     landline

In [32]:
data.groupby("month")["duration"].sum()
# This is the same as 
data.groupby("month").duration.sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [33]:
# Get the number of dates in each month
data.month.value_counts()

2014-11    230
2015-01    205
2014-12    157
2015-02    137
2015-03    101
Name: month, dtype: int64

In [34]:
# or alternatively
data.groupby("month").date.count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

In [37]:
# What is the sum of durations, for calls only, to each network
# The right order of this operation is to filter first, groupby second then sum
data[data.item=="call"].groupby("network").duration.sum()

# This should be one of the most important take away here is the order of operation

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

In [40]:
# Grouping by more variables to build more complex queries
# how many calls, sms, data entries are in each month
data.groupby(["month","item"]).month.count()

[month    item
 2014-11  call    107
          data     29
          sms      94
 2014-12  call     79
          data     30
          sms      48
 2015-01  call     88
          data     31
          sms      86
 2015-02  call     67
          data     31
          sms      39
 2015-03  call     47
          data     29
          sms      25
 Name: month, dtype: int64]

In [42]:
# How many calls, texts, and data are sent per month, split by network_type?
data.groupby(["month","network_type"]).date.count()
# Have to basically imagine what the output data frame looks like

month    network_type
2014-11  data             29
         landline          5
         mobile          189
         special           1
         voicemail         6
2014-12  data             30
         landline          7
         mobile          108
         voicemail         8
         world             4
2015-01  data             31
         landline         11
         mobile          160
         voicemail         3
2015-02  data             31
         landline          8
         mobile           90
         special           2
         voicemail         6
2015-03  data             29
         landline         11
         mobile           54
         voicemail         4
         world             3
Name: date, dtype: int64

# Groupby output format - series or dataframe?
The output from a groupby and aggregation operation varies between Pandas Series and Pandas Dataframes, which can be confusing for new users. As a rule of thumb, if you calculate more than one column of results, your result will be a Dataframe. For a single column of results, the agg function, by default, will produce a Series.

In [43]:
data.groupby("month").duration.sum() # produces pandas series

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [47]:
data.groupby(["month","network_type"])[['duration']].sum() # produces pandas dataframe

                       duration
month   network_type
2014-11 data            998.441
        landline       2906.000
        mobile        22433.000
        special           1.000
        voicemail       301.000
2014-12 data           1032.870
        landline       1424.000
        mobile        11491.000
        voicemail       690.000
        world             4.000
2015-01 data           1067.299
        landline       1603.000
        mobile        15268.000
        voicemail       285.000
2015-02 data           1067.299
        landline        730.000
        mobile        13455.000
        special           2.000
        voicemail       268.000
2015-03 data            998.441
        landline      11770.000
        mobile         9748.000
        voicemail       231.000
        world             3.000

The groupby output will have an index or multi-index on rows corresponding to your chosen grouping variables. To avoid setting this index, pass “as_index=False” to the groupby operation.

In [48]:
data.groupby("month",as_index=False).agg({"duration":"sum"})

     month   duration
0  2014-11  26639.441
1  2014-12  14641.870
2  2015-01  18223.299
3  2015-02  15522.299
4  2015-03  22750.441

In [50]:
data.groupby("month",as_index=False).sum()
# Use the agg function to specify additional details regarding the columns

     month   index   duration
0  2014-11   26337  26639.441
1  2014-12   48362  14641.870
2  2015-01  100259  18223.299
3  2015-02   90398  15522.299
4  2015-03   78679  22750.441

# Multiple Statistics per Group
The final piece of syntax that we’ll examine is the “agg()” function for Pandas. The aggregation functionality provided by the agg() function allows multiple statistics to be calculated per group in one calculation. The syntax is simple, and is similar to that of MongoDB’s aggregation framework.

## Applying a single function to columns in groups

INstructions for aggregration are provided in the form of a python dictionary or list. The dictionary keys are used to specify the columns upon which you'd like to perform operations, the dictionary values to specify the function to run.

In [51]:
# group the data frame by month and item and extract a number of stats from each group
data.groupby(["month","item"]).agg({"duration":sum,"network_type":"count","date":"first"})
# why is that some of the columns have quotes around them?

               duration  network_type                date
month   item
2014-11 call  25547.000           107 2014-10-15 06:58:00
        data    998.441            29 2014-10-15 06:58:00
        sms      94.000            94 2014-10-16 22:18:00
2014-12 call  13561.000            79 2014-11-14 17:24:00
        data   1032.870            30 2014-11-13 06:58:00
        sms      48.000            48 2014-11-14 17:28:00
2015-01 call  17070.000            88 2014-12-15 20:03:00
        data   1067.299            31 2014-12-13 06:58:00
        sms      86.000            86 2014-12-15 19:56:00
2015-02 call  14416.000            67 2015-01-15 10:36:00
        data   1067.299            31 2015-01-13 06:58:00
        sms      39.000            39 2015-01-15 12:23:00
2015-03 call  21727.000            47 2015-02-12 20:15:00
        data    998.441            29 2015-02-13 06:58:00
        sms      25.000            25 2015-02-19 18:46:00

The aggregation dictionary syntax is flexible and can be defined before the operation. You can define functions inline using "lambda" functions to extract statistics that are not provided by the built in options

In [56]:

# Define the aggregation procedure outside of the groupby operation
aggregations = {
    'duration':'sum',
    'date': lambda x: max(x) 
}
# This works by passing the dictionary into it directly
data.groupby("month").agg(aggregations)

          duration                date
month
2014-11  26639.441 2014-11-13 22:31:00
2014-12  14641.870 2014-12-14 19:54:00
2015-01  18223.299 2015-01-14 23:36:00
2015-02  15522.299 2015-02-12 06:58:00
2015-03  22750.441 2015-03-14 00:16:00

### Applying multiple functions to columns in groups 
To apply multiple functions to a single column in your grouped data, expand the syntax above to pass in a list of functions as the value in your aggregation dataframe. See below:

The common trend seems to be that a list of function, column or something needs to be passed

In [58]:
# group the data frame by month and item and extract a number of stats from each group
data.groupby(["month","item"]).agg({
    "duration":[min,max,sum],
    "network_type":"count",
    "date":[min,"first","nunique"]
})

# Damn this is like pivot table on steroids

             duration                       network_type                date  \
                  min        max        sum        count                 min
month   item
2014-11 call    1.000   1940.000  25547.000          107 2014-10-15 06:58:00
        data   34.429     34.429    998.441           29 2014-10-15 06:58:00
        sms     1.000      1.000     94.000           94 2014-10-16 22:18:00
2014-12 call    2.000   2120.000  13561.000           79 2014-11-14 17:24:00
        data   34.429     34.429   1032.870           30 2014-11-13 06:58:00
        sms     1.000      1.000     48.000           48 2014-11-14 17:28:00
2015-01 call    2.000   1859.000  17070.000           88 2014-12-15 20:03:00
        data   34.429     34.429   1067.299           31 2014-12-13 06:58:00
        sms     1.000      1.000     86.000           86 2014-12-15 19:56:00
2015-02 call    1.000   1863.000  14416.000           67 2015-01-15 10:36:00
        data   34.429     34.429   1067.299           31 2015-01-13 06:58:00
        sms     1.000      1.000     39.000           39 2015-01-15 12:23:00
2015-03 call    2.000  10528.000  21727.000           47 2015-02-12 20:15:00
        data   34.429     34.429    998.441           29 2015-02-13 06:58:00
        sms     1.000      1.000     25.000           25 2015-02-19 18:46:00


                           first nunique
month   item
2014-11 call 2014-10-15 06:58:00     104
        data 2014-10-15 06:58:00      29
        sms  2014-10-16 22:18:00      79
2014-12 call 2014-11-14 17:24:00      76
        data 2014-11-13 06:58:00      30
        sms  2014-11-14 17:28:00      41
2015-01 call 2014-12-15 20:03:00      84
        data 2014-12-13 06:58:00      31
        sms  2014-12-15 19:56:00      58
2015-02 call 2015-01-15 10:36:00      67
        data 2015-01-13 06:58:00      31
        sms  2015-01-15 12:23:00      27
2015-03 call 2015-02-12 20:15:00      47
        data 2015-02-13 06:58:00      29
        sms  2015-02-19 18:46:00      17

The agg(..) syntax is flexible and simple to use. Remember that you can pass in custom and lambda functions to your list of aggregated calculations, and each will be passed the values from the column in your grouped data.

# Renaming grouped statistics from groupby operations

When multiple statistics are calculated on columns, the resulting dataframe will have a multi-index set on the column axis. This can be difficult to work with, and I typically have to rename columns after a groupby operation.

One option is to drop the top level (using .droplevel) of the newly created multi-index on columns using: